Repository: pizza-studio/PizzaHelperUnited
Catalog: Packages/GachaKit/Sources/GachaKit/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fil, fr, it, ja, ko, ru, vi, zh_hans, zh_hant

# gachaKit.exchange.formatExplain.srgfv1
source: SRGF v1.0, established by the UIGF committee, is an exchangeable format for gacha records of Star Rail, a game produced by Cognosphere and MiHoYo. This format is marked as a vintage format and is replaced by UIGF v4.1 and has no support of new gacha pool types introduced since January 2025. There are some excellent apps on Windows which only conforms to SRGF v1.0, hence the option here for possible compatibility needs.
de: SRGF v1.0, hergestellt vom UIGF-Komitee, ist ein austauschbares Format für Gacha-Aufzeichnungen von Star Rail, einem Spiel von Cognosphere und MiHoYo. Dieses Format ist als veraltetes Format gekennzeichnet und wurde durch UIGF v4.1 ersetzt und unterstützt keine neuen Gacha-Pool-Typen, die seit Januar 2025 eingeführt wurden. Es gibt einige hervorragende Anwendungen auf Windows, die nur SRGF v1.0 entsprechen, daher die Option hier für mögliche Kompatibilitätsbedürfnisse.
es: SRGF v1.0, establecido por el comité UIGF, es un formato intercambiable para registros de gacha de Star Rail, un juego producido por Cognosphere y MiHoYo. Este formato está marcado como un formato vintage y ha sido reemplazado por UIGF v4.1 y no tiene soporte para los nuevos tipos de pool de gacha introducidos desde enero de 2025. Hay algunas excelentes aplicaciones en Windows que solo se conforman con SRGF v1.0, de ahí la opción aquí para posibles necesidades de compatibilidad.
fil: Ang SRGF v1.0, na itinatag ng komite ng UIGF, ay isang maaaring palitan na format para sa mga gacha record ng Star Rail, isang laro na ginawa ng Cognosphere at MiHoYo. Ang format na ito ay minarkahan bilang isang vintage format at napalitan ng UIGF v4.1 at walang suporta sa mga bagong uri ng gacha pool na naipakilala mula noong Enero 2025. Mayroong ilang magagandang apps sa Windows na sumusunod lamang sa SRGF v1.0, kaya narito ang opsyon para sa mga posibleng pangunahing pangangailangan sa kompabilidad.
fr: SRGF v1.0, établi par le comité UIGF, est un format échangeable pour les enregistrements gacha de Star Rail, un jeu produit par Cognosphere et MiHoYo. Ce format est marqué comme un format vintage et a été remplacé par UIGF v4.1 et n'a aucun support pour les nouveaux types de pool gacha introduits depuis janvier 2025. Il existe d'excellentes applications sur Windows qui ne se conforment qu'à SRGF v1.0, d'où l'option ici pour d'éventuels besoins de compatibilité.
it: SRGF v1.0, stabilito dal comitato UIGF, è un formato scambiabile per i record di gacha di Star Rail, un gioco prodotto da Cognosphere e MiHoYo. Questo formato è contrassegnato come formato vintage ed è stato sostituito da UIGF v4.1 e non ha supporto per i nuovi tipi di pool gacha introdotti da gennaio 2025. Ci sono alcune eccellenti app su Windows che si conformano solo a SRGF v1.0, da cui l'opzione qui per possibili esigenze di compatibilità.
ja: UIGF委員会によって確立されたSRGF v1.0フォーマット規格は、CognosphereとMiHoYoによって制作されたゲーム「スターレール」のガチャ記録のために作られた交換可能なフォーマットです。この規格は旧式フォーマットとして標識され、UIGF v4.1に置き換えられており、2025年1月以降に導入された新しいガチャプールタイプをサポートしていません。Windows上で動作するいくつかの優れたアプリはSRGF v1.0にのみ対応しているため、互換性の必要性を考慮してこのオプションが提供されています。
ko: SRGF v1.0은 UIGF 위원회에 의해 제정된 포맷으로, Cognosphere와 MiHoYo가 제작한 게임 Star Rail의 가챠 기록을 위한 교환 가능한 형식입니다. 이 형식은 빈티지 형식으로 표시되고 UIGF v4.1로 대체되었으며 2025년 1월 이후 도입된 새로운 가챠 풀 유형을 지원하지 않습니다. Windows에서 SRGF v1.0만을 준수하는 뛰어난 앱들이 있기 때문에 가능한 호환성 요구를 위해 여기 옵션이 제공됩니다.
ru: SRGF v1.0, созданный комитетом UIGF, является обменным форматом для записи гача в Star Rail, игре, разработанной Cognosphere и MiHoYo. Этот формат отмечен как винтажный формат и заменен на UIGF v4.1 и не поддерживает новые типы пулов гача, введенные с января 2025 года. Существуют некоторые отличные приложения на Windows, которые соответствуют только SRGF v1.0, поэтому здесь есть опция для возможных потребностей совместимости.
vi: SRGF v1.0, được ủy ban UIGF thiết lập, là một định dạng có thể trao đổi cho hồ sơ gacha của Star Rail, một trò chơi do Cognosphere và MiHoYo sản xuất. Định dạng này được đánh dấu là định dạng cổ điển và đã được thay thế bởi UIGF v4.1 và không hỗ trợ các loại pool gacha mới được giới thiệu từ tháng 1 năm 2025. Vẫn có một số ứng dụng tuyệt vời trên Windows chỉ tuân thủ SRGF v1.0, do đó có tùy chọn này cho các nhu cầu tương thích có thể.
zh_hans: SRGF v1.0 是由 UIGF 委员会制定的信息交换格式，用于 Cognosphere 和米哈游制作的《星穹铁道》游戏的抽卡记录。该格式被标记为旧版格式，已被 UIGF v4.1 取代，且不支持自 2025 年 1 月以来引入的新的卡池类型。Windows 平台上有一些仅支援 SRGF v1.0 的优秀应用，因此这里提供了兼容性选项以满足可能的需求。
zh_hant: SRGF v1.0 是由 UIGF 委員會制定的資訊交換格式，用於 Cognosphere 和米哈遊製作的《星穹鐵道》遊戲的抽卡記錄。此格式被標記為舊版格式，已被 UIGF v4.1 取代，且不支援自 2025 年 1 月以來引入的新的卡池類型。Windows 平台上有一些僅支援 SRGF v1.0 的優秀應用，因此這裡提供了兼容性選項以滿足可能的需求。

# gachaKit.exchange.formatExplain.uigfv4
source: UIGF v4.1, established by the UIGF committee, is a coalescent exchangeable format for gacha records of many games produced by Cognosphere and MiHoYo.
de: UIGF v4.1, etabliert vom UIGF-Komitee, ist ein zusammenhängendes, austauschbares Format für Gacha-Aufzeichnungen vieler Spiele, die von Cognosphere und MiHoYo produziert wurden.
es: UIGF v4.1, establecido por el comité UIGF, es un formato intercambiable coalescente para registros de gacha de muchos juegos producidos por Cognosphere y MiHoYo.
fil: Ang UIGF v4.1, na itinatag ng komite ng UIGF, ay isang pinagsanib na palitan na format para sa mga tala ng gacha ng maraming laro na ginawa ng Cognosphere at MiHoYo.
fr: UIGF v4.1, établi par le comité UIGF, est un format d'échange fusionné pour les enregistrements de gacha de nombreux jeux produits par Cognosphere et MiHoYo.
it: UIGF v4.1, stabilito dal comitato UIGF, è un formato scambiabile coalescente per i record gacha di molti giochi prodotti da Cognosphere e MiHoYo
ja: UIGF委員会によって確立されたUIGF v4.1フォーマット規格は、CognosphereとMiHoYoによって制作された多くのゲームのガチャ記録のために作った統合交換可能なフォーマットです。
ko: UIGF v4.1은 UIGF 위원회에 의해 수립된 포맷으로, Cognosphere와 MiHoYo에서 제작한 여러 게임의 가챠 기록을 위한 통합 가능한 교환 형식입니다.
ru: UIGF v4.1, установленный комитетом UIGF, является объединенным обменным форматом для записи гача во многих играх, созданных Cognosphere и MiHoYo.
vi: UIGF v4.1, được thiết lập bởi ủy ban UIGF, là một định dạng trao đổi hội tụ cho hồ sơ gacha của nhiều trò chơi do Cognosphere và MiHoYo sản xuất.
zh_hans: UIGF v4.1 是由 UIGF 委员会制定的聚合型信息交换格式，用于多款由 Cognosphere 和米哈游制作发行的的电玩们的抽卡记录的交换。
zh_hant: UIGF v4.1 是由 UIGF 委員會制定的聚合型資訊交換格式，用於多款由 Cognosphere 和米哈遊製作發行的的電玩們的抽卡記錄的交換。

# gachaKit.exchange.formatExplain.uigfv4.refugee
source: If you have Old Pizza Refugee Data file to import, please choose UIGFv4 format. The app will start converting its gacha entries to fix all itemIDs and then convert them into a UIGFv4 format to import instead. This process is automatic.
de: Wenn Sie eine Old Pizza Refugee Data-Datei importieren möchten, wählen Sie bitte das UIGFv4-Format. Die App beginnt dann automatisch damit, die Gacha-Einträge zu konvertieren, alle ItemIDs zu korrigieren und sie anschließend in das UIGFv4-Format umzuwandeln, um den Import abzuschließen. Dieser Vorgang erfolgt automatisch.
es: Si tienes un archivo Old Pizza Refugee Data para importar, selecciona el formato UIGFv4. La aplicación comenzará a convertir sus entradas de gacha para corregir todos los itemIDs y luego las convertirá al formato UIGFv4 para importarlas. Este proceso es automático.
fil: Kung mayroon kang Old Pizza Refugee Data file na i-import, piliin ang UIGFv4 format. Awtomatikong sisimulan ng app ang pag-convert ng mga gacha entry, aayusin ang lahat ng itemID, at iko-convert ang mga ito sa UIGFv4 format para i-import. Ang prosesong ito ay awtomatiko.
fr: Si vous avez un fichier Old Pizza Refugee Data à importer, veuillez choisir le format UIGFv4. L'application commencera à convertir ses entrées gacha pour corriger tous les itemIDs, puis les convertira au format UIGFv4 pour l'importation. Ce processus est automatique.
it: Se hai un file Old Pizza Refugee Data da importare, scegli il formato UIGFv4. L'app inizierà a convertire le sue voci gacha per correggere tutti gli itemID e poi le convertirà in formato UIGFv4 per l'importazione. Questo processo è automatico.
ja: 旧ピザ難民資料をお持ちした場合、UIGFv4 フォーマットを選択してください。アプリは自動的にガチャ記録の itemID を修正し、UIGFv4 フォーマットに変換して読み込みます。この処理は自動で行われます。
ko: Old Pizza Refugee Data 파일을 가져오려면 UIGFv4 형식을 선택하세요. 앱이 모든 itemID를 수정하고 UIGFv4 형식으로 변환하여 가져오기를 자동으로 시작합니다. 이 과정은 자동으로 진행됩니다.
ru: Если у вас есть файл Old Pizza Refugee Data для импорта, выберите формат UIGFv4. Приложение автоматически начнет конвертацию записей гача, исправит все itemID и затем преобразует их в формат UIGFv4 для импорта. Этот процесс автоматический.
vi: Nếu bạn có tệp Old Pizza Refugee Data để nhập, hãy chọn định dạng UIGFv4. Ứng dụng sẽ tự động chuyển đổi các mục gacha, sửa tất cả itemID và chuyển chúng sang định dạng UIGFv4 để nhập. Quá trình này là tự động.
zh_hans: 如果您有旧披萨难民资料需要导入的话，请选择 UIGFv4 格式。App 会自动对该文件的所有抽卡记录修正 itemID 等栏位内容、再转为 UIGFv4 格式后导入。此过程全自动完成。
zh_hant: 如果您有舊披薩難民資料需要匯入的話，請選擇 UIGFv4 格式。App 會自動對該檔案的所有抽卡記錄修正 itemID 等欄位內容、再轉為 UIGFv4 格式後匯入。此過程全自動完成。

# gachaKit.exchange.import.info.time
source: Exported at
de: Exportiert am
es: Exportado el
fil: Iniluwas noong
fr: Exporté à
it: Esportato a
ja: 書き出した時点
ko: 내보낸 시간
ru: Экспортировано в
vi: Xuất tại
zh_hans: 导出时间
zh_hant: 匯出時間

# gachaKit.exchange.import.overrideDuplicatedEntries
source: Override existing records
de: Vorhandene Datensätze überschreiben
es: Sobrescribir los registros existentes
fil: Palitan ang umiiral na mga rekord
fr: Remplacer l'historique existant
it: Sostituisci i record esistenti
ja: 既存の情報を上書きする
ko: 기존 기록 덮어쓰기
ru: Переопределить существующие записи
vi: Ghi đè lên các bản ghi hiện có
zh_hans: 覆盖既存的记录
zh_hant: 覆寫既存的記錄

# gachaKit.exchange.import.succeeded
source: Successfully imported all entries from the specified gacha puller(s) of the given file.
de: Alle Einträge aus dem/den angegebenen Gacha-Zieher(n) der angegebenen Datei erfolgreich importiert.
es: Se han importado correctamente todas las entradas de los tiradores de gacha especificados del archivo dado.
fil: Matagumpay na na-import ang lahat ng mga entry mula sa tinukoy na gacha puller(s) ng ibinigay na file.
fr: Importation réussie de toutes les entrées des tireurs gacha spécifiés du fichier donné.
it: Importati con successo tutti gli elementi dai tiratori gacha specificati del file indicato.
ja: このファイルから指定されたガチャ主のすべての記録の読み込みが完了しました。
ko: 주어진 파일의 지정된 가챠 기록 소유자로부터 모든 항목을 성공적으로 가져왔습니다.
ru: Успешно импортированы все записи из указанных владельцев гача указанного файла.
vi: Đã nhập thành công tất cả các mục từ người kéo gacha được chỉ định của tệp đã cho.
zh_hans: 已成功从指定的文件导入了指定的抽卡人的全部抽卡记录。
zh_hant: 已成功從指定的檔案匯入了指定的抽卡人的全部抽卡記錄。

# gachaKit.exchange.import.succeededReport.sectionHeader
source: Statistics: New Entries Imported
de: Statistiken: Neue Einträge importiert
es: Estadísticas: Nuevas entradas importadas
fil: Istatistika: Bagong Entries na Na-import
fr: Statistiques : Nouvelles entrées importées
it: Statistiche: Nuove voci importate
ja: 新しく読み込んだ記録の数
ko: 통계: 새 항목이 가져왔습니다
ru: Статистика: Импортированы новые записи
vi: Thống kê: Các mục nhập mới đã được nhập
zh_hans: 导入的新数据的条数统计
zh_hant: 匯入的新資料的筆數統計

# gachaKit.exchange.loadFile.button.title
source: Click Here to Load File
de: Hier klicken, um die Datei zu laden
es: Haz clic aquí para cargar el archivo
fil: I-click Dito para I-load ang File
fr: Cliquez ici pour charger le fichier
it: Fai clic qui per caricare il file
ja: タップしてファイルを選択
ko: 파일을 불러오려면 여기를 클릭하세요
ru: Щелкните здесь, чтобы загрузить файл
vi: Bấm vào đây để tải tệp
zh_hans: 点此选择要读取的文件
zh_hant: 點此選擇要讀入的檔案

# gachaKit.exchange.navTitle.exportData
source: Export Gacha Records
de: Gacha-Aufzeichnungen exportieren
es: Exportar registros de Gacha
fil: I-export ang mga Talaan ng Gacha
fr: Exporter l'historique Gacha
it: Esporta Registri Gacha
ja: ガチャ記録の書き出し
ko: 가챠 기록 내보내기
ru: Экспорт записей гача
vi: Xuất hồ sơ Gacha
zh_hans: 导出抽卡记录
zh_hant: 匯出抽卡記錄

# gachaKit.exchange.navTitle.importData
source: Import Gacha Records
de: Gacha-Aufzeichnungen importieren
es: Importar registros de Gacha
fil: I-import ang Mga Tala ng Gacha
fr: Importer l'historique Gacha
it: Importa Registri Gacha
ja: ガチャ記録の読み込み
ko: 가챠 기록 가져오기
ru: Импортировать записи Gacha
vi: Nhập hồ sơ Gacha
zh_hans: 导入抽卡记录
zh_hant: 匯入抽卡記錄

# gachaKit.exchange.startImportingData.button
source: Click Here to Start Import
de: Hier klicken, um den Import zu starten
es: Haga clic aquí para comenzar la importación
fil: I-click Dito para Simulan ang Pag-import
fr: Cliquez ici pour commencer l'importation
it: Fare clic qui per avviare l'importazione
ja: タップして読み込みを開始
ko: 가져오기를 시작하려면 여기를 클릭하세요
ru: Щелкните здесь, чтобы начать импорт
vi: Nhấp vào đây để bắt đầu nhập khẩu
zh_hans: 点此开始导入
zh_hant: 點此開始匯入

# gachaKit.exchange.tabTitle.exportData
source: EXPORT
de: EXPORTIEREN
es: EXPORTAR
fil: I-EXPORT
fr: EXPORTER
it: ESPORTA
ja: 書き出し
ko: 내보내기
ru: ЭКСПОРТ
vi: XUẤT KHẨU
zh_hans: 导出
zh_hant: 匯出

# gachaKit.exchange.tabTitle.importData
source: IMPORT
de: IMPORTIEREN
es: IMPORTAR
fil: I-IMPORT
fr: IMPORTER
it: IMPORTA
ja: 読み込み
ko: 가져오기
ru: ИМПОРТ
vi: NHẬP KHẨU
zh_hans: 导入
zh_hant: 匯入

# gachaKit.export.share.warnings.doNotShareToPublicCollectors
source: ⚠️ WARNING: Do not share your gacha records to **public** gacha record collectors who may **publicize** their statistic results.
de: ⚠️ WARNUNG: Teile deine Gacha-Aufzeichnungen nicht mit **öffentlichen** Gacha-Aufzeichnungssammlern, die ihre statistischen Ergebnisse **veröffentlichen** könnten.
es: ⚠️ ADVERTENCIA: No compartas tus registros de gacha con coleccionistas **públicos** de registros de gacha que puedan **publicar** sus resultados estadísticos.
fil: ⚠️ BABALA: Huwag ibahagi ang iyong mga gacha record sa **publiko** na nangongolekta ng mga gacha record na maaaring **ipamahagi** ang kanilang mga resulta ng istatistika.
fr: ⚠️ AVERTISSEMENT : Ne partagez pas votre historique gacha avec des sites de collecte **publiques** qui pourraient **divulguer** vos résultats à des fins de statistiques.
it: ⚠️ AVVERTENZA: Non condividere i tuoi record gacha con collezionisti gacha **pubblici** che potrebbero **pubblicizzare** i loro risultati statistici.
ja: ⚠️ 警告：貴殿などのガチャ記録を用いて作った統計結果を『公開』する可能性のある『公共』ガチャ記録収集者と共有することをご遠慮ください。
ko: ⚠️ 경고: 통계 결과를 **공개**할 수 있는 **공개** 가챠 기록 수집가에게 가챠 기록을 공유하지 마십시오.
ru: ⚠️ ПРЕДУПРЕЖДЕНИЕ: Не делитесь своими записями гача с **публичными** коллекционерами записей гача, которые могут **распространять** свои статистические результаты.
vi: ⚠️ CẢNH BÁO: Không chia sẻ hồ sơ gacha của bạn với những người thu thập hồ sơ gacha **công cộng** có thể **công khai** kết quả thống kê của họ.
zh_hans: ⚠️ 警告：请勿将您的抽卡记录分享给可能会公开其统计结果的公共抽卡记录收集者。
zh_hant: ⚠️ 警告：請勿將您的抽卡記錄分享給可能會公開其統計結果的公共抽卡記錄收集者。

# gachaKit.exportPackageMethod.allOwners
source: All Owners
de: Alle Eigentümer
es: Todos los propietarios
fil: Lahat ng May-ari
fr: Tous les propriétaires
it: Tutti i proprietari
ja: すべての所有者
ko: 모든 소유자
ru: Все владельцы
vi: Tất cả Chủ sở hữu
zh_hans: 全部的持有者
zh_hant: 全部的持有者

# gachaKit.exportPackageMethod.singleOwner
source: Specified Owner
de: Angegebener Eigentümer
es: Propietario Especificado
fil: Tinukoy na May-ari
fr: Propriétaire spécifié
it: Proprietario specificato
ja: 指定した所有者（１人）
ko: 지정된 소유자
ru: Указанный владелец
vi: Chủ sở hữu được chỉ định
zh_hans: 指定的持有者（单名）
zh_hant: 指定的持有者（單名）

# gachaKit.exportPackageMethod.specifiedOwners
source: Specified Owners
de: Angegebene Eigentümer
es: Propietarios especificados
fil: Tiyak na Mga May-ari
fr: Propriétaires spécifiés
it: Proprietari specificati
ja: 指定した所有者（多人）
ko: 지정된 소유자
ru: Указанные владельцы
vi: Các chủ sở hữu được chỉ định
zh_hans: 指定的持有者（多名）
zh_hant: 指定的持有者（多名）

# gachaKit.FileExchangeException.accessFailureComDlg32
source: Insufficient privileges on accessing the given file.
de: Unzureichende Berechtigungen für den Zugriff auf die angegebene Datei.
es: Privilegios insuficientes para acceder al archivo dado.
fil: Walang sapat na pribilehiyo sa pag-access sa ibinigay na file.
fr: Privilèges insuffisants pour accéder au fichier demandé.
it: Privilegi insufficienti per accedere al file fornito.
ja: このファイルのアクセスにはさらなる権限が必要である。
ko: 주어진 파일에 대한 접근 권한이 부족합니다.
ru: Недостаточно прав доступа для открытия данного файла.
vi: Không đủ quyền để truy cập tệp được cung cấp.
zh_hans: 对该文件的访问需要更多的权限。
zh_hant: 對該檔案的存取需要更多的權限。

# gachaKit.FileExchangeException.fileNotExist
source: Either the specified file does not exist or is inaccessible.
de: Entweder existiert die angegebene Datei nicht oder sie ist nicht zugänglich.
es: El archivo especificado no existe o es inaccesible.
fil: Maaaring ang tinukoy na file ay hindi umiiral o hindi ma-access.
fr: Soit le fichier spécifié n'existe pas, soit il est inaccessible.
it: O il file specificato non esiste oppure è inaccessibile.
ja: 指定されたファイルが存在しないか、アクセスできません。
ko: 지정된 파일이 존재하지 않거나 접근할 수 없습니다.
ru: Указанный файл либо не существует, либо недоступен.
vi: Tệp được chỉ định không tồn tại hoặc không thể truy cập.
zh_hans: 指定的文件不存在或无法访问。
zh_hant: 指定的檔案不存在或無法存取。

# gachaKit.FileExchangeException.fileParseFailure
source: The given file does not match the chosen file format.
de: Die ausgewählte Datei stimmt nicht mit dem gewählten Dateiformat überein.
es: El archivo proporcionado no coincide con el formato de archivo elegido.
fil: Ang ibinigay na file ay hindi tumutugma sa napiling format ng file.
fr: Le fichier fourni ne correspond pas au format de fichier choisi.
it: Il file fornito non corrisponde al formato di file scelto
ja: 指定されたファイルは、選択されたファイル形式として解読できませんでした。
ko: 지정된 파일이 선택된 파일 형식과 일치하지 않습니다.
ru: Указанный файл не соответствует выбранному формату файла
vi: Tệp đã cho không khớp với định dạng tệp đã chọn.
zh_hans: 该文件无法以指定的格式解读。
zh_hant: 該檔案無法以指定的格式解讀。

# gachaKit.FileExchangeException.uigfEntryInsertionError
source: Error happened on inserting the imported gacha entries into the database.
de: Fehler beim Einfügen der importierten Gacha-Einträge in die Datenbank aufgetreten.
es: Se produjo un error al insertar las entradas de gacha importadas en la base de datos.
fil: Nagkaroon ng error sa pagpasok ng mga inangkat na gacha entries sa database
fr: Une erreur s'est produite lors de l'insertion des entrées de gacha importées dans la base de données
it: Si è verificato un errore durante l'inserimento delle voci gacha importate nel database.
ja: ガチャ記録をデータベースに書き込む時にはエラーが発生しました。
ko: 데이터베이스에 가져온 가챠 항목을 삽입하는 중 오류가 발생했습니다.
ru: Произошла ошибка при вставке импортированных записей гача в базу данных.
vi: Đã xảy ra lỗi khi chèn các mục gacha đã nhập vào cơ sở dữ liệu.
zh_hans: 往数据库内写入正在导入的抽卡记录时出现错误。
zh_hant: 往資料庫內寫入正在匯入的抽卡記錄時出現錯誤。

# gachaKit.filter.options
source: Filter Options
de: Filteroptionen
es: Opciones de Filtro
fil: Mga Pagpipilian sa Filter
fr: Filtres
it: Opzioni di filtro
ja: フィルター設定
ko: 필터 옵션
ru: Параметры фильтра
vi: Tùy chọn bộ lọc
zh_hans: 筛选设定
zh_hant: 篩選設定

# gachaKit.filter.rarity
source: Rarity Rank
de: Seltenheitsrang
es: Rango de Rareza
fil: Ranggo ng Kahirapan
fr: Rareté
it: Grado di Rarità
ja: 稀有度ランク
ko: 희귀 등급
ru: Ранг редкости
vi: Hạng Độ Hiếm
zh_hans: 稀有等级
zh_hant: 稀有等級

# gachaKit.filter.showDate
source: Show Timestamp
de: Zeitstempel anzeigen
es: Mostrar marca de tiempo
fil: Ipakita ang Selyo ng Oras
fr: Afficher la date
it: Mostra timestamp
ja: 日時記録も表示
ko: 타임스탬프 표시
ru: Показать временную метку
vi: Hiển thị Dấu thời gian
zh_hans: 显示时间戳
zh_hant: 顯示時間戳

# gachaKit.gachaLanguage
source: Gacha Language
de: Gacha-Sprache
es: Idioma Gacha
fil: Wikang Gacha
fr: Langue du gacha
it: Linguaggio Gacha
ja: 言語
ko: 가챠 언어
ru: Гача язык
vi: Ngôn ngữ Gacha
zh_hans: 抽卡语言
zh_hant: 抽卡語言

# gachaKit.gachaLanguage.languageSupported.explanation
source: ⚠︎ Italian and Turkish languages are only supported by Genshin Impact.
de: ⚠︎ Italienisch und Türkisch werden nur von Genshin Impact unterstützt.
es: ⚠︎ Los idiomas italiano y turco solo son compatibles con Genshin Impact.
fil: ⚠︎ Ang Italian at Turkish na mga wika ay sinusuportahan lamang ng Genshin Impact.
fr: ⚠︎ Les langues italienne et turque sont uniquement prises en charge par Genshin Impact.
it: ⚠︎ Le lingue italiano e turco sono supportate solo da Genshin Impact
ja: ⚠︎ イタリア語とトルコ語は原神以外のゲームには未だにサポート対象外です。
ko: ⚠︎ 이탈리아어와 터키어는 Genshin Impact에서만 지원됩니다.
ru: ⚠︎ Итальянский и турецкий языки поддерживаются только в Genshin Impact.
vi: ⚠︎ Chỉ có Genshin Impact hỗ trợ ngôn ngữ tiếng Ý và tiếng Thổ Nhĩ Kỳ
zh_hans: ⚠︎ 意大利文与土耳其文的导出暂不支援除了原神以外的游戏。
zh_hant: ⚠︎ 義大利文與土耳其文的匯出暫不支援除了原神以外的遊戲。

# gachaKit.GachaMetaDBError.DatabaseExpired
source: Local GachaMetaDB cache expired. A possible reason is the failure of fetching the latest remote database. If you are situated in Mainland China without solid access to GitHub, please contact the developer regarding the situation of the outdated mirrors.
de: Lokaler GachaMetaDB-Cache ist abgelaufen. Ein möglicher Grund ist das Scheitern beim Abrufen der neuesten Remote-Datenbank. Wenn Sie sich in Festlandchina befinden und keinen stabilen Zugriff auf GitHub haben, wenden Sie sich bitte an den Entwickler, um den Status der veralteten Spiegelserver zu klären.
es: La caché local de GachaMetaDB ha caducado. Una posible razón es el fallo al obtener la última base de datos remota. Si te encuentras en China continental sin acceso estable a GitHub, contacta con el desarrollador para consultar la situación de los espejos desactualizados.
fil: Nag-expire ang local GachaMetaDB cache. Posibleng dahilan ay ang kabiguang makuha ang pinakabagong remote database. Kung ikaw ay nasa Mainland China at walang matatag na access sa GitHub, mangyaring kontakin ang developer tungkol sa sitwasyon ng mga luma nang mirror.
fr: Le cache local GachaMetaDB a expiré. Une raison possible est l'échec de la récupération de la dernière base de données distante. Si vous êtes en Chine continentale sans accès fiable à GitHub, veuillez contacter le développeur concernant la situation des miroirs obsolètes.
it: La cache locale di GachaMetaDB è scaduta. Una possibile ragione è il fallimento nel recuperare l'ultimo database remoto. Se ti trovi nella Cina continentale senza accesso stabile a GitHub, contatta lo sviluppatore riguardo la situazione dei mirror obsoleti.
ja: ローカルGachaMetaDBキャッシュは失効しました。主な原因は最新のリモートデータベースの取得失敗です。中国本土でGitHubへの安定したアクセスがない場合は、開発者に連絡してミラーの古い状況について確認してください。
ko: 로컬 GachaMetaDB 캐시가 만료되었습니다. 가능한 원인은 최신 원격 데이터베이스를 가져오지 못한 것입니다. 중국 본토에서 GitHub에 안정적으로 접근할 수 없다면, 개발자에게 연락하여 구버전 미러의 상황을 문의하세요.
ru: Срок действия локального кеша GachaMetaDB истек. Возможная причина — не удалось получить последнюю удалённую базу данных. Если вы находитесь в материковом Китае без стабильного доступа к GitHub, обратитесь к разработчику по поводу ситуации с устаревшими зеркалами.
vi: Bộ nhớ đệm GachaMetaDB cục bộ đã hết hạn. Nguyên nhân có thể là do không lấy được cơ sở dữ liệu từ xa mới nhất. Nếu bạn ở Trung Quốc đại lục mà không thể truy cập ổn định vào GitHub, hãy liên hệ với nhà phát triển để hỏi về tình trạng các máy chủ mirror đã lỗi thời.
zh_hans: 本机 GachaMetaDB 缓存已过期。可能是未能获取到最新的远端数据库。如果您身处中国大陆且无法稳定访问 GitHub，请联系开发者调查确认相关资料库在中国大陆的镜照是否过期。
zh_hant: 本機 GachaMetaDB 快取已過期。可能是未能獲取到最新的遠端資料庫。如果您位於中國大陸且無法穩定訪問 GitHub，請聯絡開發者調查確認相關資料庫在中國大陸的鏡照是否過期。
